package helpers;

import org.testng.annotations.DataProvider;

public class StaticProvider {
    @DataProvider (name = "dataForLimitValues")
    public static Object[][] dataForLimitValueTest() {
        return new Object[][] {
                {"a", "1 character input"},
                {"ааааааааааааааааааааааааааааааааааааааа" +
                        "ааааааааааааааааааааааааааааааааа" +
                        "аааааааааааааааааааааааааааа" +
                        "ааааааааа" +
                        "ааааааааааааааааааааааааааааааааааа" +
                        "ааааааааа" +
                        "ааааааааааааааааааааааааааааааааааааа" +
                        "ааааааааааааа" +
                        "ааааааааааааааааааааааааааааааааааааа" +
                        "ааааааааа", "249 character input"},
                {"ааааааааааааааааааааааааааааааааааааааа" +
                        "ааааааааааааааааааааааааааааааааа" +
                        "аааааааааааааааааааааааааааа" +
                        "ааааааааа" +
                        "ааааааааааааааааааааааааааааааааааа" +
                        "ааааааааа" +
                        "ааааааааааааааааааааааааааааааааааааа" +
                        "ааааааааааааа" +
                        "ааааааааааааааааааааааааааааааааааааа" +
                        "аааааааааa", "250 character input"}

        };
    }
}